In [1]:
import pandas as pd

data = pd.read_csv('sample.csv')
data.head()

  loc1 loc2  para1  dow  para2    para3  para4   price
0    0   01      1  Mon    662   3000.0    3.8  73.49`
1    9   99      1  Thu    340   2760.0    9.2   300.0
2    0   04      0  Mon     16   2700.0    3.0   130.0
3    4   40      1  Mon     17  12320.0    6.4   365.0
4    5   50      1  Thu    610   2117.0   10.8   357.5

In [2]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 8 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   loc1    10000 non-null  object
 1   loc2    10000 non-null  object
 2   para1   10000 non-null  int64
 3   dow     10000 non-null  object
 4   para2   10000 non-null  int64
 5   para3   10000 non-null  float64
 6   para4   10000 non-null  float64
 7   price   10000 non-null  object
dtypes: float64(2), int64(2), object(4)
memory usage: 625.1+ KB

In [3]:
val_cnt_loc1 = data['loc1'].value_counts()
val_cnt_loc2 = data['loc2'].value_counts()

print('{}\n{}\n'.format('loc 1', val_cnt_loc1))
print('{}\n{}'.format('loc 2', val_cnt_loc2))

loc 1
2    1607
0    1486
1    1223
7    1081
3     945
5     846
4     773
8     727
9     690
6     620
S       1
T       1
Name: loc1, dtype: int64

loc 2
21    499
06    454
74    329
12    273
14    246
     ...
0T      1
43      1
S6      1
0B      1
0N      1
Name: loc2, Length: 107, dtype: int64

In [4]:
print(data[data["loc1"].str.contains("S")])
print(data[data["loc1"].str.contains("T")])

     loc1 loc2  para1  dow  para2    para3  para4  price
3026    S   S6      3  Fri   1289  24000.0   13.6  850.0
     loc1 loc2  para1  dow  para2   para3  para4  price
5510    T   TS      3  Fri   1472  1600.0    2.0  440.0

In [5]:
data = data[(data["loc1"].str.contains("S") == False) & (data["loc1"].str.contains("T") == False)]
data.shape

(9998, 8)

In [11]:
# Rows to check
rows_to_check = [2887, 4850, 5647, 7751, 8466]

# Select the rows to check
rows_checked = data.loc[rows_to_check]

# Display the selected rows
print(rows_checked)

     loc1 loc2  para1  dow  para2    para3  para4   price
2887    0   0B      2  Mon    801   1091.0    9.0  1350.0
4850    0   0T      2  Mon   1473   4000.0    2.0  1890.0
5647    0   0L      2  Wed   1127  10000.0   13.6   750.0
7751    0   0C      3  Fri    623   1500.0    6.0   400.0
8466    0   0N      3  Fri   1298   3500.0    2.1  1500.0

In [12]:
data["loc2"] = pd.to_numeric(data["loc2"], errors='coerce')
data["loc1"] = pd.to_numeric(data["loc1"], errors='coerce')
data.dropna(inplace = True)

In [14]:
data.shape

(9993, 8)

In [15]:
data.head()

   loc1  loc2  para1  dow  para2    para3  para4   price
0     0   1.0      1  Mon    662   3000.0    3.8  73.49`
1     9  99.0      1  Thu    340   2760.0    9.2   300.0
2     0   4.0      0  Mon     16   2700.0    3.0   130.0
3     4  40.0      1  Mon     17  12320.0    6.4   365.0
4     5  50.0      1  Thu    610   2117.0   10.8   357.5